// В файле index.html создайте скрипт который выводит в
// консоль текст “Текст из index.html”

// console.log("Текст из index.html");

// Задание 2 (тайминг 25 минут)
// Текст задания
// 1. Создайте переменную num и присвойте ей значение 123. Выведите
// значение этой переменной в консоль
// 2. Создайте переменную а и присвойте ей значение 5, переопределите
// переменную а на значение 7, выведите переменную а в консоль
// 3. Создайте переменную b. Запишите в нее сумму чисел 1, 2 и 3. С
// помощью функции console.log выведите в консоль содержимое
// переменной b.
// 4. Создайте 2 вида комментариев в вашем коде, добавьте в них
// произвольный текст

// const num = 123;
// console.log(num);
// let a = 5;
// a = 7;
// console.log(a);
// let b = 1 + 2 + 3;
// console.log(b);
/*xv;k f; 
sfkjnslvj
veokmv*/

// Задание 3 (тайминг 20 минут)
// 1. Создайте переменную c со значением 10 и переменную d со
// значением 2.
// a. Все созданные переменные должны быть логично названы
// b. Создайте переменную суммы и присвойте сумму чисел (c,d)
// c. Создайте переменную разности и присвойте разность чисел
// (c,d)
// d. Создайте переменную прозведения и присвойте произведение
// чисел (c,d)
// e. Создайте переменную частного и присвойте деление чисел
// (c,d)
// f. Выведите в консоль все созданные переменные
// g. Сложите все созданные переменные и выведите результат в
// консоль

// let c = 10;
// let d = 2;
// let summCD = c + d;
// console.log(summCD);

// let differenceCD = c - d;
// console.log(differenceCD);

// let productCD = c * d;
// console.log(productCD);

// let quotientCD = c / d;
// console.log(quotientCD);

// console.log(summCD + differenceCD + productCD + quotientCD);

// Задание 3:
// 1. Создайте две переменные, одна будет хранить ваш возраст (девушкам всегда 18), а другая переменная
// будет хранить текущий год (все созданные переменные должны быть логично названы).
// - Создайте переменную суммы и присвойте сумму чисел из двух переменных.
// - Создайте переменную разности и присвойте разность текущего года и вашего возраста.
// - Создайте переменную произведения и присвойте произведение чисел двух переменных.
// - Создайте переменную частного и присвойте деление чисел текущего года к вашему возрасту.

// const myAge = +prompt("Введите возраст: ");
// const year = 2024;
// console.log(myAge, year);
// const summ = myAge + year;
// console.log(`Сумма равна: ${summ}`);
// const difference = year - myAge;
// console.log(`Разность равна: ${difference}`);
// const product = year * myAge;
// console.log(`Произведение равно: ${product}`);
// const quotient = year / myAge;
// console.log(`Частное равно: ${quotient}`);
// console.log(`ИТОГО ${summ + difference + product + quotient}`);

// const str = "123.245646546";
// console.log(str);
// console.log(+str);
// console.log(Number(str));
// console.log(Number.parseInt(str));
// console.log(Number.parseFloat(str));
// 2. Выведите в консоль все созданные переменные.
// 3. Сложите все созданные переменные и выведите результат в консоль.
// Тайминг: 20 минут.

// Задание 4 (тайминг 10 минут)
// 1. Не запуская код, определите, что выведется в консоль:
// a. let a = 5 + 5 * 3 + 3;
// 2. Не запуская код, определите, что выведется в консоль:
// a. let a = 8 / 2 + 2;
// 3. Не запуская код, определите, что выведется в консоль:
// a. let a = (2 + 3) * (2 + 3);
// 4. Не запуская код, определите, что выведется в консоль:
// a. let a = (2 + 3) * 2 + 3;
// 5. Не запуская код, определите, что выведется в консоль:
// a. let a = (2 * 8) / 4;
// 6. Не запуская код, определите, что выведется в консоль:
// a. let a = 2 * (8 / 4);

// Задание 5:
// 1. Запишите в переменную `a` число `0.1`, а в переменную `b` - число `0.2`.
// Найдите сумму значений этих переменных и выведите ее на экран.
const a = 0.1;
const b = 0.2;
const summ = a + b;

console.log(summ.toFixed(1));
Math.round(num * 10) / 10; 
Math.floor(num * 10) / 10;
Math.cell(num * 10) / 10;
Math.trunc(num * 10) / 10;

// 2. Создайте переменную `c`, запишите в нее какое-нибудь положительное или отрицательное число.
// Выведите на экран это число с обратным знаком.
// Тайминг: 5 минут.
