"use strict";

/*
Необходимо попросить пользователя ввести число.
Если пользователь ввел отличное от числа значение, необходимо вывести в консоль
строку: "Значение задано неверно", иначе необходимо будет вызвать функцию 
(нужно будет ее создать), которая будет принимать введенное пользователем 
число. Функция должна вычесть из переданного ей числа 13% и вывести в консоль 
сообщение "Размер заработной платы за вычетом налогов равен N."
*/

// const enterNumber = Number(prompt("Введите число: "));
// function salarySize(num) {
//   if (isNaN(num)) {
//     return console.log("Значение задано неверно");
//   } else if (num > 0) {
//     return num * 0.87;
//   }
// }

// // function findTax(num) {
// //   return num * 0.87;
// // }

// console.log(
//   `Размер заработной платы за вычетом налогов равен ${salarySize(enterNumber)}`
// );

