"use strict";

/*
Необходимо попросить пользователя ввести три числа.
Необходимо создать функцию, в которую мы должны передать эти три числа.
Функция должна определить максимальное, среди переданных ей значение и 
вывести сообщение: "Максимальное значение среди чисел N1, N2, N3 равно N."

Примечание: Условимся, что пользователь всегда вводит корректные значения, 
три числа. Проверять их не нужно.
*/
// const N1 = Number(prompt("Введите число 1: "));
// const N2 = Number(prompt("Введите число 2: "));
// const N3 = Number(prompt("Введите число 3: "));

// function findMax(N1, N2, N3) {
//   return Math.max(N1, N2, N3);
// }
// console.log(
//   `Максимальное значение среди чисел ${N1}, ${N2}, ${N3} равно ${findMax(N1, N2, N3)}.`
// );
