// Задание 1:

// 1. Написать функцию, которая принимает, имя, фамилия и возраст. Функция должна
// вывести в консоль строку:
// "Привет, `имя` `фамилия`. Вы уже большой, вам `возраст`."
// ***************************************************************************************
// function userinfo(name, surname, age) {
//   console.log(`Привет, ${name} ${surname}. Вы уже большой, вам ${age}.`);
// }
// userinfo(`Иван`, `Иванов`, 18);
// ***************************************************************************************
// ***************************************************************************************
// 2. Создайте функцию, которая принимает число, а возвращает квадрат переданного
// ей числа.
// ***************************************************************************************
// function makeSquere(x) {
//   return x ** 2; если бы не было прописано "return", то функция вернула бы "undefined"
// т.к. функция всегда что-то возвращает.
// }
// console.log(makeSquere(6));
// ***************************************************************************************
// ***************************************************************************************
// 3. Создайте функцию, которая принимает число.
// Функция должна вывести в консоль '+++', если число положительное, либо '---',
// если число было отрицательное. В случае, если было передано не число, либо ноль,
// функция ничего не должна выводить.
// ***************************************************************************************
// function numberPositive(number) {
//   if (typeof number !== number) {
//     return;
//   }

//   if (number > 0) {
//     console.log("+++");
//   } else if (number < 0) {
//     console.log("---");
//   }
// }
// numberPositive("asdkjhb");
// ***************************************************************************************
// Задание 2:
// 1. Создайте функцию, которая параметрами принимает 3 числа и выводит в
// консоль сумму этих чисел.
// Создайте три переменные, со случайными значениями и продемонстрируйте работу
// данной функции.
// ***************************************************************************************
// const summNumbers = (a, b, c) => console.log(a + b + c);
// const a = Math.trunc(Math.random() * 10);
// const b = Math.trunc(Math.random() * 10);
// const c = Math.trunc(Math.random() * 10);

// summNumbers(a, b, c);
// ***************************************************************************************
// ***************************************************************************************

// 3. Дан код:

// ```
// func(2);
// func(3);
// func();

// function func(num = 5) {
//   console.log(num * num);
// }
// ```

// Расскажите, каким будет результат каждого из вызовов функции.

// Задание 3:

// 1. Создайте функцию, которая принимает число, а возвращает квадратный корень
// переданного числа.
// С помощью созданной функции найдите сумму корней чисел 3 и 4 и выведите данную
// сумму в консоль.
// ***************************************************************************************
// const root = (x) => Math.sqrt(x);
// console.log(root(3) + root(4));
// ***************************************************************************************
// ***************************************************************************************
// 2. Создайте функцию, которая находит минимальное число из 2х переданных
// аргументов функции и вернет найденное значение.
// ***************************************************************************************
// const findMin = (x, y) => Math.min(x, y);
// console.log(findMin(123456789, 321654987));
// ***************************************************************************************
// ***************************************************************************************
// Задание 4:

// 1. Создайте функцию, которая принимает параметром число от 1 до 7, а возвращает
// день недели на русском языке.
// ***************************************************************************************
// const number = Number(prompt("Введите число от 1 до 7"));
// function dayWeek(num) {
//   switch (num) {
//     case 1:
//       return "Понедельник";
//     case 2:
//       return "Вторник";
//     case 3:
//       return "Среда";
//     default:
//       "Неверное число";
//   }
// }
// ***************************************************************************************
// const number = Number(prompt("Введите число от 1 до 7"));
// function dayWeek(num) {
//   switch (num) {
//     case 1:
//       console.log("Понедельник");
//       break;
//     case 2:
//       console.log("Вторник");
//       break;
//     case 3:
//       console.log("Среда");
//     default:
//         console.log("Неверное число");
//   }
// }
// dayWeek(number);
// ***************************************************************************************
// ***************************************************************************************
// 2. Создайте функцию, которой мы передаем имя и она возвращает приветствие в
// зависимости от времени суток (утро, день, вечер, ночь), например:
// "Добрый день, Иван." или "Доброй ночи, Иван.".
// ***************************************************************************************
function sayHello(name) {
  const time = new Date();
  const hour = time.getHours();
  if (hour >= 0 && hour <= 6) {
    return `Доброй ночи, ${name}.`;
  } else if (hour >= 6 && hour < 12) {
    return `Доброе утро, ${name}.`;
  } else if (hour >= 12 && hour < 18) {
    return `Добрый день, ${name}.`;
  } else {
    return `Добрый вечер, ${name}.`;
  }
}
console.log(sayHello("Kate")); 
// ***************************************************************************************
// ***************************************************************************************
